month = int(input("month number: "))

season = {12: 'зима',
          1: 'зима',
          2: 'зима',
          3: 'весна',
          4: 'весна',
          5: 'весна',
          6: 'лето',
          7: 'лето',
          8: 'лето',
          9: 'осень',
          10: 'осень',
          11: 'осень'
}

print(f": {month} is season {season[month]}")

season_2 = ['зима',
           'зима',
           'зима',
           'весна',
           'весна',
           'весна',
           'лето',
           'лето',
           'лето',
           'осень',
           'осень',
           'осень']
print(f": {month} is season {season[month - 1]}")